# 14852번 타일 채우기 3
# https://www.acmicpc.net/problem/14852

"""
2 * N 크기의 벽을 2*1 1*2 1*1 타일로 채우는 경우의 수
1*1 : 0, 2*1 : 1, 1*2 : 2
1   2
0   1
0   1

2   7
00  01  10  11  22  22  00
00  01  10  11  00  22  22

3   22
022  022  000
000  022  022
122  122  100
100  122  122
000  010  100  110  220  220  000
000  010  100  110  000  220  220
001  011  101  111  221  221  001
001  011  101  111  001  221  221
022  220
220  022

dp[idx] = dp[idx-1]에 (1*1 2개 또는 2*1 1개를 놓는 방법, 즉 2배) +
          dp[idx-2]에 (1*2 1개/1*1 2개 상하반전 2배, 1*2 2개, 즉 3배) +
          sum(dp[1],...dp[idx-3])에 dp[1]부터 022/220과 같은 교차가 시작될 수 있으므로 2배
"""

N = int(input())
dp = [0 for _ in range(N+10)]
dp_prefix = [0 for _ in range(N+10)]
dp[1] = 2
dp[2] = 7
dp[3] = 22
dp_prefix[3] = 1
for idx in range(4, N+1):
    dp_prefix[idx] = dp_prefix[idx-1] + dp[idx-3]
    dp[idx] = (dp[idx-1] * 2 + dp[idx-2] * 3 + dp_prefix[idx] * 2) % 1_000_000_007
print(dp[N])
